
/* Alert title. */
"success_activation_alert_title" = "Great job";
/* Alert message. Parameter is an application name. */
"success_activation_alert_message" = "You've successfully activated %@ via Setapp";

/* Error description. Alert title. */
"setapp_error_device_limit_description" = "Device limit reached";
/* Error failure reason. Alert message. Part 1/2. */
"setapp_error_device_limit_failure_reason" = "You’re using Setapp on maximum devices.";
/* Error recovery suggestion. Alert message. Part 2/2. */
"setapp_error_device_limit_recovery_suggestion" = "Please check your user account for more information";

/* Error description. Alert title. */
"setapp_error_expired_auth_token_description" = "There’s an issue with your QR code";
/* Error failure reason. Alert message. Part 1/2. */
"setapp_error_expired_auth_token_failure_reason" = "";
/* Error recovery suggestion. Alert message. Part 2/2. */
"setapp_error_expired_auth_token_recovery_suggestion" = "Please refresh the app page and try again.";

/* Error description. Alert title. */
"setapp_error_request_timeout_description" = "Connection timed out";
/* Error failure reason. Alert message. Part 1/2. */
"setapp_error_request_timeout_failure_reason" = "It takes too long to respond to your request.";
/* Error recovery suggestion. Alert message. Part 2/2. */
"setapp_error_request_timeout_recovery_suggestion" = "Please check your network connection and try again.";

/* Error description. Alert title. */
"setapp_error_no_internet_description" = "Network error occurred";
/* Error failure reason. Alert message. Part 1/2. */
"setapp_error_no_internet_failure_reason" = "";
/* Error recovery suggestion. Alert message. Part 2/2. */
"setapp_error_no_internet_recovery_suggestion" = "Please check your connection and try again.";

/* Error description. Alert title. */
"setapp_error_generic_pre_contact_support_description" = "Sorry, something went wrong";
/* Error failure reason. Alert message. Part 1/2. */
"setapp_error_generic_pre_contact_support_failure_reason" = "";
/* Error recovery suggestion. Alert message. Part 2/2. */
"setapp_error_generic_pre_contact_support_recovery_suggestion" = "Please try again.";

/* Error description. Alert title. */
"setapp_error_generic_description" = "Sorry, something went wrong";
/* Error failure reason. Alert message. Part 1/2. */
"setapp_error_generic_failure_reason" = "";
/* Error recovery suggestion. Alert message. Part 2/2. */
"setapp_error_generic_recovery_suggestion" = "Please try again.";

/* Error description. Alert title. */
"setapp_error_generic_contact_support_description" = "Something is not right here";
/* Error failure reason. Alert message. Part 1/2. */
"setapp_error_generic_contact_support_failure_reason" = "";
/* Error recovery suggestion. Alert message. Part 2/2. */
"setapp_error_generic_contact_support_recovery_suggestion" = "Please contact Setapp support for help.";

/* Button title. */
"ok_button_title" = "Ok";
